---------------------- THE HUNT CONFIGURATION FILE ----------------------
include( 'basewaves.lua' )
CombineFirstWave = 7
CombineSecondWave = 10
CombineThirdWave = 13
CombineFourthWave = 15
CombineFifthWave = 20
CombineInfiniteWave = 20
MAP_PROPS = {'models/props_wasteland/controlroom_desk001a.mdl', 'models/props_wasteland/kitchen_counter001d.mdl', 'models/props_wasteland/kitchen_shelf001a.mdl', 'models/props_c17/bench01a.mdl', 'models/props_wasteland/laundry_cart001.mdl', 'models/props_wasteland/laundry_cart002.mdl'}
ITEMPLACES = {
Vector(-310.411743, 548.826050, 70.688103),
Vector(-196.10800170898, -167.04194641113, 43.326202392578),
Vector(-199.9642791748, -160.95834350586, 65.007080078125),
Vector(-198.82182312012, -159.29968261719, 103.8243560791),
Vector(-254.71929931641, -169.84854125977, 51.486179351807),
Vector(-280.7307434082, -174.60856628418, 51.498081207275),
Vector(-516.49084472656, -173.8935546875, 51.480842590332),
Vector(-485.21029663086, -172.7961730957, 51.473785400391),
Vector(-688.48229980469, -305.54824829102, 63.012348175049),
Vector(-677.63208007813, -373.80694580078, 63.022136688232),
Vector(-652.72717285156, -216.33409118652, 72.359886169434),
Vector(-408.08712768555, -677.19653320313, 43.328281402588),
Vector(-395.22842407227, -679.30218505859, 65.067611694336),
Vector(-398.1083984375, -523.28839111328, 65.036972045898),
Vector(-704.94006347656, -569.16363525391, 66.030891418457),
Vector(-686.22418212891, -558.67022705078, 65.732543945313),
Vector(-582.21820068359, -623.62719726563, 60.304954528809),
Vector(-309.85137939453, -723.43310546875, 71.568267822266),
Vector(-205.44027709961, -723.65618896484, 71.56884765625),
Vector(-107.86156463623, -727.904296875, 69.25511932373),
Vector(482.46060180664, -483.85556030273, 69.32763671875),
Vector(457.65887451172, -717.18322753906, 32.03125),
Vector(534.14166259766, -725.33538818359, 32.03125),
Vector(350.28546142578, -829.31744384766, 53.179153442383),
Vector(199.4365234375, -1359.4801025391, 65.076889038086),
Vector(19.597841262817, -1166.3715820313, 53.089561462402),
Vector(-350.46594238281, -1050.705078125, 64.03125),
Vector(-354.75628662109, -884.12738037109, 64.03125),
Vector(75.597099304199, -870.92224121094, 65.02368927002),
Vector(-687.53857421875, -1320.4925537109, 43.330699920654),
Vector(-694.00158691406, -1147.3212890625, 43.308662414551),
Vector(-583.51062011719, -855.53631591797, 65.702919006348),
Vector(-557.16333007813, -869.75128173828, 65.80680847168),
Vector(331.1301574707, -547.76556396484, 195.48359680176),
Vector(71.944519042969, -734.15692138672, 213.49488830566),
Vector(-70.397827148438, -915.12927246094, 213.23768615723),
Vector(-351.453125, -789.82257080078, 176.03125),
Vector(-131.43391418457, -783.40979003906, 176.03125),
Vector(-134.41102600098, -964.86706542969, 176.03125),
Vector(-359.49230957031, -523.49426269531, 209.06864929199),
Vector(-356.51318359375, -642.28405761719, 209.02705383301),
Vector(-204.18048095703, -241.27770996094, 216.49995422363),
Vector(-176.47053527832, -258.0002746582, 216.5055847168),
Vector(24.182666778564, -248.0152130127, 209.01892089844),
Vector(673.11822509766, -1136.3045654297, 37.08544921875),
Vector(673.74633789063, -1271.970703125, 37.085441589355)
}

combinespawnzones = {Vector(317.388824, 575.915283, 33.499802)}
zonescovered = {Vector(828.899414, -789.851868, 32.401539), Vector(-515.163635, -313.838593, 32.401539), Vector(7.335999, -572.919800, 176.401535), Vector(12.289578, -1214.128540, 176.401535)}
function GM:PlayerInitialSpawn(ply)
timer.Simple(2, function() ply:PrintMessage(HUD_PRINTTALK, "[Альянс]: Всем автономным отрядам: Начать принудительную ассимиляцию сектора.") end )
timer.Simple(4, function() ply:PrintMessage(HUD_PRINTTALK, "[Альянс]: Произвести контролированное изменение численности. Выделить и идентифицировать объекты") end )
timer.Simple(12, function() ply:PrintMessage(HUD_PRINTTALK, "Подсказка: !taunt - крик, который привлекает комбайнов поблизости.") end )
timer.Simple(14, function() ply:PrintMessage(HUD_PRINTTALK, "Подсказка: !remain - показывает кол-во комбайнов на карте.") end )
end

function MapSetup()
for k, v in pairs(ents.FindByClass('func_door_rotating')) do print(v:GetClass()) v:SetKeyValue( 'spawnflags', '32' ) v:Fire('Open','',0) end
table.foreach(SPAWNPOINTS_TO_DELETE, function(key,value) for k, v in pairs(ents.FindByClass(value)) do print(v:GetClass()) v:Remove() end end)
SpawnItem('info_player_start', Vector(472.079376, -724.192200, 59.938560),Angle(0.000, 45.000, 0.000))
end
---------------------- END OF CONFIGURATION FILE ----------------------
