---------------------- THE HUNT CONFIGURATION FILE ----------------------
include( 'basewaves.lua' )
CombineFirstWave = 7
CombineSecondWave = 10
CombineThirdWave = 13
CombineFourthWave = 15
CombineFifthWave = 20
CombineInfiniteWave = 20
MAP_PROPS = {'models/props_wasteland/controlroom_desk001a.mdl', 'models/props_wasteland/laundry_cart001.mdl', 'models/props_wasteland/laundry_cart002.mdl','models/props_wasteland/cafeteria_table001a.mdl', 'models/props_wasteland/kitchen_shelf001a.mdl','models/props_wasteland/kitchen_shelf002a.mdl'}
ITEMPLACES = {
Vector(-754.644409, 2992.507080, 38.340076),
Vector(-703.47766113281, -1645.8972167969, 48.783592224121),
Vector(-728.18432617188, -1634.5859375, 48.812690734863),
Vector(-673.10198974609, -1489.0334472656, 32.999893188477),
Vector(-595.76525878906, -1490.2169189453, 33.032405853271),
Vector(-474.71578979492, -1523.8431396484, 33.893966674805),
Vector(-473.74530029297, -1487.2236328125, 33.901817321777),
Vector(-85.612518310547, -1753.1955566406, 33.948757171631),
Vector(2.9076499938965, -1766.0919189453, 48.03125),
Vector(508.63482666016, -1352.7357177734, 33.96607208252),
Vector(275.33770751953, -1036.7666015625, 11.348052978516),
Vector(272.23709106445, -1034.3902587891, 33.059585571289),
Vector(291.54089355469, -761.15100097656, 0.031253814697266),
Vector(299.73663330078, -586.86938476563, 0.03125),
Vector(416.75112915039, -535.458984375, 32.990440368652),
Vector(-219.15968322754, -763.51776123047, 0.03125),
Vector(-219.69354248047, -588.845703125, 0.03125),
Vector(-348.34085083008, -523.53643798828, 33.064533233643),
Vector(-339.40246582031, -522.63201904297, 11.35111618042),
Vector(689.80645751953, -1625.7413330078, 33.004055023193),
Vector(763.39282226563, -1631.0307617188, 33.010986328125),
Vector(689.83203125, -1618.7546386719, 11.297283172607),
Vector(1103.5335693359, -1982.4920654297, 32.997947692871),
Vector(1106.3740234375, -2067.4001464844, 33.022415161133),
Vector(-404.1145324707, -210.24783325195, 17.672695159912),
Vector(-512.72229003906, 74.880699157715, 44.347557067871),
Vector(-507.74172973633, 56.309097290039, 44.518203735352),
Vector(-1515.4880371094, -769.28741455078, 11.360191345215),
Vector(-1517.9243164063, -741.12384033203, 11.331607818604),
Vector(-1335.6291503906, -853.12567138672, 48.923362731934),
Vector(-834.11138916016, 808.77496337891, 63.028553009033),
Vector(-784.18383789063, 804.38122558594, 62.998931884766),
Vector(-932.02093505859, 814.36145019531, 65.069702148438),
Vector(-897.19281005859, 549.15454101563, 68.03125),
Vector(-382.74890136719, 771.59069824219, 65.943420410156),
Vector(-513.38671875, 552.83819580078, 43.38077545166),
Vector(-420.83731079102, 554.10974121094, 43.373462677002),
Vector(-989.24346923828, 968.38720703125, 43.373733520508),
Vector(-989.50335693359, 895.31475830078, 43.367721557617),
Vector(933.8125, 861.958984375, 63.010936737061),
Vector(944.14617919922, 696.51049804688, 66.009857177734),
Vector(-208.96322631836, 1936.9155273438, 15.338096618652),
Vector(132.80352783203, 1778.5989990234, 15.374015808105),
Vector(-292.47271728516, 2504.2075195313, 31.044170379639),
Vector(-288.88269042969, 2536.6042480469, 31.029205322266),
Vector(-458.03479003906, 2512.8474121094, 31.050071716309),
Vector(-951.93841552734, 2991.2407226563, 49.388526916504),
Vector(-928.43853759766, 2946.2202148438, 46.685249328613)
}

combinespawnzones = {Vector(-1706.499634, 3568.995117, 1.488960)}
zonescovered = {Vector(12.003983, 223.564133, 0.401537), Vector(-1387.635742, -9.821785, 0.349936), Vector(2478.219727, 991.750732, 0.374813), Vector(-289.176239, 2430.446777, 0.401537), Vector(56.992546, -1416.461182, 0.401537)}
function GM:PlayerInitialSpawn(ply)
timer.Simple(2, function() ply:PrintMessage(HUD_PRINTTALK, "[Альянс]: Всем автономным отрядам: Начать принудительную ассимиляцию сектора.") end )
timer.Simple(4, function() ply:PrintMessage(HUD_PRINTTALK, "[Альянс]: Произвести контролированное изменение численности. Выделить и идентифицировать объекты") end )
timer.Simple(12, function() ply:PrintMessage(HUD_PRINTTALK, "Подсказка: !taunt - крик, который привлекает комбайнов поблизости.") end )
timer.Simple(14, function() ply:PrintMessage(HUD_PRINTTALK, "Подсказка: !remain - показывает кол-во комбайнов на карте.") end )
end

function MapSetup()
for k, v in pairs(ents.FindByClass('func_door_rotating')) do print(v:GetClass()) v:SetKeyValue( 'spawnflags', '32' ) v:Fire('Open','',0) end
table.foreach(SPAWNPOINTS_TO_DELETE, function(key,value) for k, v in pairs(ents.FindByClass(value)) do print(v:GetClass()) v:Remove() end end)
SpawnItem('info_player_start', Vector(1123.077759, -1754.563599, 23.701078),Angle(-0.000, -90.000, 0.000))
SpawnItem('info_player_start', Vector(2650.154297, 724.596619, 20.351681),Angle(0.026, -89.987, -0.082))
SpawnItem('info_player_start', Vector(-1577.701660, -549.849731, -78.771759),Angle(-0.000, 90.000, 0.000))
SpawnItem('info_player_start', Vector(-1611.173950, 683.417419, -102.421112),Angle(-0.000, -90.000, 0.000))
SpawnItem('info_player_start', Vector(-228.347305, -616.624573, 21.621725),Angle(-0.000, 180.000, -0.000))
SpawnTurret(Vector(-1279.147095, 146.837540, 0.763561),Angle(0.321, -177.175, 0.650))
SpawnCeilingTurretStrong(Vector(1506.728027, 1135.923950, 447.968750),Angle(0.000, 266.433, 0.000))
SpawnCeilingTurretStrong(Vector(1498.764526, 544.381836, 447.968750),Angle(0.000, 86.433, 0.000))
SpawnItem('item_healthcharger', Vector(288.000000, 2304.000000, 56.000000),Angle(0.000, 0.000, 0.000))
SpawnItem('item_healthcharger', Vector(-688.000000, 528.000000, 80.000000),Angle(0.000, 90.000, 0.000))
SpawnDynamicAmmoCrate(Vector(2563.583984, 1598.065674, 0.415592),Angle(-0.043, 138.612, -0.189))
SpawnDynamicAmmoCrate(Vector(2560.873535, 1601.215942, 24.816547),Angle(-0.059, 138.765, -0.158))
SpawnDynamicAmmoCrate(Vector(2329.018311, 1106.035522, 40.781769),Angle(0.010, 39.937, -0.025))
SpawnDynamicAmmoCrate(Vector(2352.102051, 978.905945, 17.487789),Angle(90.000, -135.521, 180.000))
SpawnDynamicAmmoCrate(Vector(-431.987396, -462.999237, 0.449642),Angle(0.003, 23.393, 0.194))
SpawnDynamicAmmoCrate(Vector(-449.483002, -369.111786, 17.442663),Angle(89.835, -86.215, 22.599))
SpawnDynamicAmmoCrate(Vector(-462.226593, -404.419861, 15.517396),Angle(0.048, 110.829, -90.000))
SpawnDynamicAmmoCrate(Vector(-452.265137, -443.071198, 15.516788),Angle(0.050, 20.519, -90.186))
SpawnDynamicAmmoCrate(Vector(-457.084564, -440.901154, 32.986286),Angle(0.538, -8.134, 0.396))
SpawnItem('button_turrets',Vector(972.462341, 803.787292, 89.559074),Angle(0.001, -179.999, -0.213))

end
---------------------- END OF CONFIGURATION FILE ----------------------
